# Задача 1 
# По двум заданным числам проверить является ли одно квадратом второго.

a = int(input('Введите a: '))
b = int(input('Введите b: '))
print(a == b ** 2)