# Задача 4
# Показать первую цифру дробной части числа.

n = 0.98
res = int(n * 10 % 10)
print(res)